//Задание 8, вариант -  3
//Вывод таблицы значений функции y = x² − 2x + 1 для x от −5 до 5

#include <iostream>
#include <iomanip> //для форматирования вывода таблицы

using namespace std;

int main() {
    //выводим заголовок таблицы
    cout << setw(5) << "x" << " | " << setw(5) << "y" << "\n";
    cout << "----------------\n";

    // Цикл от -5 до 5 включительно
    for (int x = -5; x <= 5; x++) {
        // Вычисляем значение функции y = x^2 - 2x + 1
        int y = x * x - 2 * x + 1;

        // Выводим значения
        cout << setw(5) << x << " | " << setw(5) << y << "\n";
    }
    return 0;
}